{
  "</box>": 151654,
  "</img>": 151647,
  "</quad>": 151650,
  "</ref>": 151652,
  "<IMG_CONTEXT>": 151648,
  "<box>": 151653,
  "<img>": 151646,
  "<quad>": 151649,
  "<ref>": 151651,
  "<|endoftext|>": 151643,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644
}
